test/Fixture/Payout/core_to_plus.json

{
  "name": "SepaViaGeDetails",
  "gate_id": "eco_dev",
  "type": "payout",
  "operation_id": 11223344,
  "amount": 1000000,
  "currency": "RUB",
  "client_params": {
    "account": "201030300303030303",
    "email": "ABUMonkey22@google.com",
    "custom": {
      "accountholder":"abu monkey"
    }
  },
  "merchant_params": {
    "name": "ShopName",
    "identity": "1",
    "wallet_id": "2",
    "APIKey": "MjMyNDQxMjM6NDUzRmRnZDQ0M",
    "payout_create_url": "https://test_payout.ru/wallet/v0/destinations",
    "payout_check_create_url": "https://test_payout.ru/wallet/v0/destinations/{destinationID}",
    "payout_url_complete": "https://test_payout.ru/wallet/v0/withdrawals",
    "balance_url": "https://test_payout.ru/wallet/v0/wallets/{walletID}/account",
    "check_status_url": "https://test_payout.ru/wallet/v0/withdrawals/{withdrawalID}",
    "destination_lifetime": 20,
    "max_payout_amount": 10000,
    "min_payout_amount": 15000000,
    "check_status_lifetime": 86400
  }
}